-- 인덱스의 실제 사용

-- 인덱스 생성
CREATE [UNIQUE] INDEX 인덱스 이름
	ON 테이블이름 (열이름) [ASC | DESC];
	
-- CREATE INDEX로 샡성되는 인덱스는 보조 인덱스임
-- UNIQUE는 중복이 안되는 고유 인덱스를 생성하는 것. 생략하면 중복을 허용함
-- > UNIQUE 인덱스를 생성하려면 기존에 입력된 값들이 중복이 있으면 안됨
-- > 인덱스를 생성한 후에 입력되는 데이터와도 중복될 수 없음
-- -- 회원 이름은 중복이 있을 수도 있기 때문에 UNIQUE를 지정하면 안되지만, 휴대폰 번호나 이메일 등은 사람마다 모두
-- -- 다르기 떄문에 UNIQUE로 지정해도 문제 없음
-- ASC 또는 DESC는 인덱스를 오름차순 또는 내림차순으로 만들어줌
-- > 기본은 ASC로 만들어지며, 굳이 DESC로 만드는 경우는 거의 없음

-- 인덱스 제거
DROP INDEX 인덱스이름 ON 테이블이름;
-- > 기본키, 고유키로 자동생성된 인덱스는 DROP INDEX로 제거하지 못함
-- -- 자동 생성된 인덱스는 ALTER TABLE로 기본키나 고유키를 제거하면 함께 제거됨

-- > 하나의 테이블에 클러스터형 인덱스와 보조 인덱스가 모두 있는 경우에는 인덱스를 제거할 때 보조인덱스부터
-- -- 클러스터형 인덱스가 제거되면 내부적으로 데이터가 재구성되기 때문

-- 인덱스가 많이 생성되어 있는 테이블은 사용하지 않는 인덱스를 제거해주는 것이 오히려 성능 향상에 도움이 됨

